* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
*    This macro is our interpretation of IBM's "internal use only"    *
*    control block macro:  IKJTPVT  (TSO PARMLIB Vector Table)        *
*    The field names are not necessarily IBM's field names.           *
*  The names in this macro have been adjusted for format with CBMACS. *
* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
         MACRO
         IKJTPVT
TPVT     DSECT                         TSO PARMLIB VECTOR TABLE
TPVT_ID  DS    CL4'TPVT'            00 BLOCK ID
TPVT_LEN DS    H'72'                04 LENGTH OF TPVT
****     DS    H'220'                  LENGTH OF TPVT          HTE26E2
TPVT_VERS DS   FL1'2'               06 VERSION
TPVT_MEM1 DS  0C'IKJTSO00'          07 CURRENT PARMLIB MEMBER  HTE25E2
TPVTFIL1 DS    X                                               HTE26E2
TPVT_MEM DS    CL8'IKJTSO00'        08 CURRENT PARMLIB MEMBER  HTE26E2
TPVT_GEN DS    F                    10 PARMLIB generation count
TPVTCTLT DS    V(CTLT)              14 IKJCTLT
TPVTCTLTLEN  DS F'60'               18 length of CTLT
         DS    4X                   1C
TPVTSEND DS    V(SCB)               20 IKJEESCB   (SYS1.BRODCAST)
TPVTALPL DS    V(ALPL)              24 ALPL       (ALLOCATE defaults)
TPVTTEST DS    V(TPT)               28 TPT (TEST)
TPVTXPRMD DS   V(XPRM)              2C INMXPARM   (XMIT)
TPVTCONSOLE DS V(CNPRM)             30 IKJCNPRM   (CONSOLE)
TPVTFCVEC DS   A,F                  34 FCVE       (Platform commands)
TPVTHELP DS    V(HCB)               3C IKJEFHCB   (HELP)
TPVTPPVEC DS   A,F                  40 PPVE       (Platform programs)
           ORG  TPVT+X'4C'
TPVTLOGON DS   X                    4C IKJTSOxx LOGON KEYWORD
* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
* The following bit settings must correspond to the same bit settings *
* in the TSVTFLG1 field of the TSVT (TSVT + X'5') - lower nibble only *
* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
TPVTPHRS  EQU  X'08'                Password phrase support active
TPVTAPPL  EQU  X'04'                LOGON applid verification active
TPVTLGNH  EQU  X'02'                LOGONHERE support is active
TPVTLGPC  EQU  X'01'                LOGONPREPROMPT is active
* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
TPVTUMXL  DS   X                4D  MAXIMUM NUMBER OF CHARS IN USERID
*   This is a reflection of the value in TSVTUMXL, but the "real      *
*   switch" where the system "decides" if 8-character userids are     *
*   allowed, appears to be TSVT+X'6', not in this value.              *
*   Permissible values:  X'00' for pre z/OS 2.3 systems               *
*                        X'07' for z/OS 2.3 with 8-char uids off.     *
*                        X'08' for z/OS 2.3 with 8-char uids on.      *
* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
TPVTTO     DS  XL1                  4E Logon Timeout Value (mins)
           ORG  TPVT+X'50'
TPVTDSNAM  DS  CL44'SYS1.PARMLIB'   50 dsname                  HTE26E2
TPVTVOLSER DS  CL6'SYSCAT'          7C VOLSER                  HTE26E2
           DS  2X                                              HTE26E2
TPVTSYSNAM DS  CL8'P390'            84 from system             HTE26E2
TPVTUSERID DS  CL8'IBMUSERM'        8C by userid               HTE26E2
TPVTHHMMSS DS  CL8'16:59:56'        94 at hh:mm:ss             HTE26E2
TPVTYYMMDD DS  CL10'1998-10-29'     9C on yyyy-mm-dd           HTE26E2
TPVTCPUIDP DS  XL2                  A6 CPUID prefix
TPVTCPUID  DS  F                    A8 CPUID
TPVTMODEL  DS  H                    AC CPU Model
TPVTUPDTIM DS  XL4                  AA Update Time
TPVTUPDDAT DS  XL4                  B2 Update Date
TPVTFEATURE DS  X                   B6 Feature
*              X'80'            Dynamic Broadcast Feature is available
TPVTFEATVER DS X                    B7 Feature Version
         ORG   TPVT+X'DC'              end of TPVT             HTE26E2
         MEND
